       procedure division.
           call "Sections"
           call "Sections"
           cancel "Sections"
           call "Sections"

           stop run
           .