      $set dialect(ANS85)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWLD.

       PROCEDURE DIVISION.
       100-PROGRAM.
           DISPLAY "HELLO, COBOL WORLD!"
           STOP RUN
           .